def @main(%data: Tensor[(1024, 3, 299, 299), float32] /* ty=Tensor[(1024, 3, 299, 299), float32] */, %conv_conv1_weight: Tensor[(32, 3, 3, 3), float32] /* ty=Tensor[(32, 3, 3, 3), float32] */, %conv_bn_gamma: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %conv_bn_beta: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %conv_bn_moving_mean: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %conv_bn_moving_var: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %conv_1_conv1_weight: Tensor[(32, 32, 3, 3), float32] /* ty=Tensor[(32, 32, 3, 3), float32] */, %conv_1_bn_gamma: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %conv_1_bn_beta: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %conv_1_bn_moving_mean: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %conv_1_bn_moving_var: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %conv_2_conv1_weight: Tensor[(64, 32, 3, 3), float32] /* ty=Tensor[(64, 32, 3, 3), float32] */, %conv_2_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %conv_2_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %conv_2_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %conv_2_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %conv_3_conv1_weight: Tensor[(80, 64, 1, 1), float32] /* ty=Tensor[(80, 64, 1, 1), float32] */, %conv_3_bn_gamma: Tensor[(80), float32] /* ty=Tensor[(80), float32] */, %conv_3_bn_beta: Tensor[(80), float32] /* ty=Tensor[(80), float32] */, %conv_3_bn_moving_mean: Tensor[(80), float32] /* ty=Tensor[(80), float32] */, %conv_3_bn_moving_var: Tensor[(80), float32] /* ty=Tensor[(80), float32] */, %conv_4_conv1_weight: Tensor[(192, 80, 3, 3), float32] /* ty=Tensor[(192, 80, 3, 3), float32] */, %conv_4_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %conv_4_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %conv_4_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %conv_4_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_conv_conv1_weight: Tensor[(64, 192, 1, 1), float32] /* ty=Tensor[(64, 192, 1, 1), float32] */, %mixed_conv_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_conv_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_conv_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_conv_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_tower_conv_conv1_weight: Tensor[(48, 192, 1, 1), float32] /* ty=Tensor[(48, 192, 1, 1), float32] */, %mixed_tower_conv_bn_gamma: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_tower_conv_bn_beta: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_tower_conv_bn_moving_mean: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_tower_conv_bn_moving_var: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_tower_conv_1_conv1_weight: Tensor[(64, 48, 5, 5), float32] /* ty=Tensor[(64, 48, 5, 5), float32] */, %mixed_tower_conv_1_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_tower_conv_1_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_tower_conv_1_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_tower_conv_1_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_tower_1_conv_conv1_weight: Tensor[(64, 192, 1, 1), float32] /* ty=Tensor[(64, 192, 1, 1), float32] */, %mixed_tower_1_conv_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_tower_1_conv_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_tower_1_conv_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_tower_1_conv_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_tower_1_conv_1_conv1_weight: Tensor[(96, 64, 3, 3), float32] /* ty=Tensor[(96, 64, 3, 3), float32] */, %mixed_tower_1_conv_1_bn_gamma: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_tower_1_conv_1_bn_beta: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_tower_1_conv_1_bn_moving_mean: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_tower_1_conv_1_bn_moving_var: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_tower_1_conv_2_conv1_weight: Tensor[(96, 96, 3, 3), float32] /* ty=Tensor[(96, 96, 3, 3), float32] */, %mixed_tower_1_conv_2_bn_gamma: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_tower_1_conv_2_bn_beta: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_tower_1_conv_2_bn_moving_mean: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_tower_1_conv_2_bn_moving_var: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_tower_2_conv_conv1_weight: Tensor[(32, 192, 1, 1), float32] /* ty=Tensor[(32, 192, 1, 1), float32] */, %mixed_tower_2_conv_bn_gamma: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %mixed_tower_2_conv_bn_beta: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %mixed_tower_2_conv_bn_moving_mean: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %mixed_tower_2_conv_bn_moving_var: Tensor[(32), float32] /* ty=Tensor[(32), float32] */, %mixed_1_conv_conv1_weight: Tensor[(64, 256, 1, 1), float32] /* ty=Tensor[(64, 256, 1, 1), float32] */, %mixed_1_conv_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_conv_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_conv_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_conv_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_conv_conv1_weight: Tensor[(48, 256, 1, 1), float32] /* ty=Tensor[(48, 256, 1, 1), float32] */, %mixed_1_tower_conv_bn_gamma: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_1_tower_conv_bn_beta: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_1_tower_conv_bn_moving_mean: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_1_tower_conv_bn_moving_var: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_1_tower_conv_1_conv1_weight: Tensor[(64, 48, 5, 5), float32] /* ty=Tensor[(64, 48, 5, 5), float32] */, %mixed_1_tower_conv_1_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_conv_1_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_conv_1_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_conv_1_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_1_conv_conv1_weight: Tensor[(64, 256, 1, 1), float32] /* ty=Tensor[(64, 256, 1, 1), float32] */, %mixed_1_tower_1_conv_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_1_conv_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_1_conv_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_1_conv_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_1_conv_1_conv1_weight: Tensor[(96, 64, 3, 3), float32] /* ty=Tensor[(96, 64, 3, 3), float32] */, %mixed_1_tower_1_conv_1_bn_gamma: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_1_tower_1_conv_1_bn_beta: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_1_tower_1_conv_1_bn_moving_mean: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_1_tower_1_conv_1_bn_moving_var: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_1_tower_1_conv_2_conv1_weight: Tensor[(96, 96, 3, 3), float32] /* ty=Tensor[(96, 96, 3, 3), float32] */, %mixed_1_tower_1_conv_2_bn_gamma: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_1_tower_1_conv_2_bn_beta: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_1_tower_1_conv_2_bn_moving_mean: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_1_tower_1_conv_2_bn_moving_var: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_1_tower_2_conv_conv1_weight: Tensor[(64, 256, 1, 1), float32] /* ty=Tensor[(64, 256, 1, 1), float32] */, %mixed_1_tower_2_conv_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_2_conv_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_2_conv_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_1_tower_2_conv_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_conv_conv1_weight: Tensor[(64, 288, 1, 1), float32] /* ty=Tensor[(64, 288, 1, 1), float32] */, %mixed_2_conv_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_conv_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_conv_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_conv_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_conv_conv1_weight: Tensor[(48, 288, 1, 1), float32] /* ty=Tensor[(48, 288, 1, 1), float32] */, %mixed_2_tower_conv_bn_gamma: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_2_tower_conv_bn_beta: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_2_tower_conv_bn_moving_mean: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_2_tower_conv_bn_moving_var: Tensor[(48), float32] /* ty=Tensor[(48), float32] */, %mixed_2_tower_conv_1_conv1_weight: Tensor[(64, 48, 5, 5), float32] /* ty=Tensor[(64, 48, 5, 5), float32] */, %mixed_2_tower_conv_1_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_conv_1_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_conv_1_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_conv_1_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_1_conv_conv1_weight: Tensor[(64, 288, 1, 1), float32] /* ty=Tensor[(64, 288, 1, 1), float32] */, %mixed_2_tower_1_conv_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_1_conv_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_1_conv_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_1_conv_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_1_conv_1_conv1_weight: Tensor[(96, 64, 3, 3), float32] /* ty=Tensor[(96, 64, 3, 3), float32] */, %mixed_2_tower_1_conv_1_bn_gamma: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_2_tower_1_conv_1_bn_beta: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_2_tower_1_conv_1_bn_moving_mean: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_2_tower_1_conv_1_bn_moving_var: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_2_tower_1_conv_2_conv1_weight: Tensor[(96, 96, 3, 3), float32] /* ty=Tensor[(96, 96, 3, 3), float32] */, %mixed_2_tower_1_conv_2_bn_gamma: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_2_tower_1_conv_2_bn_beta: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_2_tower_1_conv_2_bn_moving_mean: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_2_tower_1_conv_2_bn_moving_var: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_2_tower_2_conv_conv1_weight: Tensor[(64, 288, 1, 1), float32] /* ty=Tensor[(64, 288, 1, 1), float32] */, %mixed_2_tower_2_conv_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_2_conv_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_2_conv_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_2_tower_2_conv_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_3_conv_conv1_weight: Tensor[(384, 288, 3, 3), float32] /* ty=Tensor[(384, 288, 3, 3), float32] */, %mixed_3_conv_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_3_conv_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_3_conv_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_3_conv_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_3_tower_conv_conv1_weight: Tensor[(64, 288, 1, 1), float32] /* ty=Tensor[(64, 288, 1, 1), float32] */, %mixed_3_tower_conv_bn_gamma: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_3_tower_conv_bn_beta: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_3_tower_conv_bn_moving_mean: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_3_tower_conv_bn_moving_var: Tensor[(64), float32] /* ty=Tensor[(64), float32] */, %mixed_3_tower_conv_1_conv1_weight: Tensor[(96, 64, 3, 3), float32] /* ty=Tensor[(96, 64, 3, 3), float32] */, %mixed_3_tower_conv_1_bn_gamma: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_3_tower_conv_1_bn_beta: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_3_tower_conv_1_bn_moving_mean: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_3_tower_conv_1_bn_moving_var: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_3_tower_conv_2_conv1_weight: Tensor[(96, 96, 3, 3), float32] /* ty=Tensor[(96, 96, 3, 3), float32] */, %mixed_3_tower_conv_2_bn_gamma: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_3_tower_conv_2_bn_beta: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_3_tower_conv_2_bn_moving_mean: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_3_tower_conv_2_bn_moving_var: Tensor[(96), float32] /* ty=Tensor[(96), float32] */, %mixed_4_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_4_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_conv_conv1_weight: Tensor[(128, 768, 1, 1), float32] /* ty=Tensor[(128, 768, 1, 1), float32] */, %mixed_4_tower_conv_bn_gamma: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_conv_bn_beta: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_conv_bn_moving_mean: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_conv_bn_moving_var: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_conv_1_conv1_weight: Tensor[(128, 128, 1, 7), float32] /* ty=Tensor[(128, 128, 1, 7), float32] */, %mixed_4_tower_conv_1_bn_gamma: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_conv_1_bn_beta: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_conv_1_bn_moving_mean: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_conv_1_bn_moving_var: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_conv_2_conv1_weight: Tensor[(192, 128, 7, 1), float32] /* ty=Tensor[(192, 128, 7, 1), float32] */, %mixed_4_tower_conv_2_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_conv_2_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_conv_2_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_conv_2_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_1_conv_conv1_weight: Tensor[(128, 768, 1, 1), float32] /* ty=Tensor[(128, 768, 1, 1), float32] */, %mixed_4_tower_1_conv_bn_gamma: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_bn_beta: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_bn_moving_mean: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_bn_moving_var: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_1_conv1_weight: Tensor[(128, 128, 7, 1), float32] /* ty=Tensor[(128, 128, 7, 1), float32] */, %mixed_4_tower_1_conv_1_bn_gamma: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_1_bn_beta: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_1_bn_moving_mean: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_1_bn_moving_var: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_2_conv1_weight: Tensor[(128, 128, 1, 7), float32] /* ty=Tensor[(128, 128, 1, 7), float32] */, %mixed_4_tower_1_conv_2_bn_gamma: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_2_bn_beta: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_2_bn_moving_mean: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_2_bn_moving_var: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_3_conv1_weight: Tensor[(128, 128, 7, 1), float32] /* ty=Tensor[(128, 128, 7, 1), float32] */, %mixed_4_tower_1_conv_3_bn_gamma: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_3_bn_beta: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_3_bn_moving_mean: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_3_bn_moving_var: Tensor[(128), float32] /* ty=Tensor[(128), float32] */, %mixed_4_tower_1_conv_4_conv1_weight: Tensor[(192, 128, 1, 7), float32] /* ty=Tensor[(192, 128, 1, 7), float32] */, %mixed_4_tower_1_conv_4_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_1_conv_4_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_1_conv_4_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_1_conv_4_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_2_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_4_tower_2_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_2_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_2_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_4_tower_2_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_5_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_conv_conv1_weight: Tensor[(160, 768, 1, 1), float32] /* ty=Tensor[(160, 768, 1, 1), float32] */, %mixed_5_tower_conv_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_conv_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_conv_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_conv_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_conv_1_conv1_weight: Tensor[(160, 160, 1, 7), float32] /* ty=Tensor[(160, 160, 1, 7), float32] */, %mixed_5_tower_conv_1_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_conv_1_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_conv_1_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_conv_1_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_conv_2_conv1_weight: Tensor[(192, 160, 7, 1), float32] /* ty=Tensor[(192, 160, 7, 1), float32] */, %mixed_5_tower_conv_2_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_conv_2_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_conv_2_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_conv_2_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_1_conv_conv1_weight: Tensor[(160, 768, 1, 1), float32] /* ty=Tensor[(160, 768, 1, 1), float32] */, %mixed_5_tower_1_conv_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_1_conv1_weight: Tensor[(160, 160, 7, 1), float32] /* ty=Tensor[(160, 160, 7, 1), float32] */, %mixed_5_tower_1_conv_1_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_1_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_1_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_1_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_2_conv1_weight: Tensor[(160, 160, 1, 7), float32] /* ty=Tensor[(160, 160, 1, 7), float32] */, %mixed_5_tower_1_conv_2_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_2_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_2_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_2_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_3_conv1_weight: Tensor[(160, 160, 7, 1), float32] /* ty=Tensor[(160, 160, 7, 1), float32] */, %mixed_5_tower_1_conv_3_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_3_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_3_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_3_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_5_tower_1_conv_4_conv1_weight: Tensor[(192, 160, 1, 7), float32] /* ty=Tensor[(192, 160, 1, 7), float32] */, %mixed_5_tower_1_conv_4_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_1_conv_4_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_1_conv_4_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_1_conv_4_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_2_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_5_tower_2_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_2_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_2_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_5_tower_2_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_6_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_conv_conv1_weight: Tensor[(160, 768, 1, 1), float32] /* ty=Tensor[(160, 768, 1, 1), float32] */, %mixed_6_tower_conv_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_conv_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_conv_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_conv_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_conv_1_conv1_weight: Tensor[(160, 160, 1, 7), float32] /* ty=Tensor[(160, 160, 1, 7), float32] */, %mixed_6_tower_conv_1_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_conv_1_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_conv_1_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_conv_1_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_conv_2_conv1_weight: Tensor[(192, 160, 7, 1), float32] /* ty=Tensor[(192, 160, 7, 1), float32] */, %mixed_6_tower_conv_2_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_conv_2_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_conv_2_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_conv_2_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_1_conv_conv1_weight: Tensor[(160, 768, 1, 1), float32] /* ty=Tensor[(160, 768, 1, 1), float32] */, %mixed_6_tower_1_conv_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_1_conv1_weight: Tensor[(160, 160, 7, 1), float32] /* ty=Tensor[(160, 160, 7, 1), float32] */, %mixed_6_tower_1_conv_1_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_1_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_1_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_1_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_2_conv1_weight: Tensor[(160, 160, 1, 7), float32] /* ty=Tensor[(160, 160, 1, 7), float32] */, %mixed_6_tower_1_conv_2_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_2_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_2_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_2_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_3_conv1_weight: Tensor[(160, 160, 7, 1), float32] /* ty=Tensor[(160, 160, 7, 1), float32] */, %mixed_6_tower_1_conv_3_bn_gamma: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_3_bn_beta: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_3_bn_moving_mean: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_3_bn_moving_var: Tensor[(160), float32] /* ty=Tensor[(160), float32] */, %mixed_6_tower_1_conv_4_conv1_weight: Tensor[(192, 160, 1, 7), float32] /* ty=Tensor[(192, 160, 1, 7), float32] */, %mixed_6_tower_1_conv_4_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_1_conv_4_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_1_conv_4_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_1_conv_4_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_2_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_6_tower_2_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_2_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_2_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_6_tower_2_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_7_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_7_tower_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_1_conv1_weight: Tensor[(192, 192, 1, 7), float32] /* ty=Tensor[(192, 192, 1, 7), float32] */, %mixed_7_tower_conv_1_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_1_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_1_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_1_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_2_conv1_weight: Tensor[(192, 192, 7, 1), float32] /* ty=Tensor[(192, 192, 7, 1), float32] */, %mixed_7_tower_conv_2_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_2_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_2_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_conv_2_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_7_tower_1_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_1_conv1_weight: Tensor[(192, 192, 7, 1), float32] /* ty=Tensor[(192, 192, 7, 1), float32] */, %mixed_7_tower_1_conv_1_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_1_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_1_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_1_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_2_conv1_weight: Tensor[(192, 192, 1, 7), float32] /* ty=Tensor[(192, 192, 1, 7), float32] */, %mixed_7_tower_1_conv_2_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_2_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_2_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_2_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_3_conv1_weight: Tensor[(192, 192, 7, 1), float32] /* ty=Tensor[(192, 192, 7, 1), float32] */, %mixed_7_tower_1_conv_3_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_3_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_3_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_3_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_4_conv1_weight: Tensor[(192, 192, 1, 7), float32] /* ty=Tensor[(192, 192, 1, 7), float32] */, %mixed_7_tower_1_conv_4_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_4_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_4_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_1_conv_4_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_2_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_7_tower_2_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_2_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_2_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_7_tower_2_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_8_tower_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_conv_1_conv1_weight: Tensor[(320, 192, 3, 3), float32] /* ty=Tensor[(320, 192, 3, 3), float32] */, %mixed_8_tower_conv_1_bn_gamma: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_8_tower_conv_1_bn_beta: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_8_tower_conv_1_bn_moving_mean: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_8_tower_conv_1_bn_moving_var: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_8_tower_1_conv_conv1_weight: Tensor[(192, 768, 1, 1), float32] /* ty=Tensor[(192, 768, 1, 1), float32] */, %mixed_8_tower_1_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_1_conv1_weight: Tensor[(192, 192, 1, 7), float32] /* ty=Tensor[(192, 192, 1, 7), float32] */, %mixed_8_tower_1_conv_1_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_1_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_1_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_1_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_2_conv1_weight: Tensor[(192, 192, 7, 1), float32] /* ty=Tensor[(192, 192, 7, 1), float32] */, %mixed_8_tower_1_conv_2_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_2_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_2_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_2_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_3_conv1_weight: Tensor[(192, 192, 3, 3), float32] /* ty=Tensor[(192, 192, 3, 3), float32] */, %mixed_8_tower_1_conv_3_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_3_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_3_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_8_tower_1_conv_3_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_9_conv_conv1_weight: Tensor[(320, 1280, 1, 1), float32] /* ty=Tensor[(320, 1280, 1, 1), float32] */, %mixed_9_conv_bn_gamma: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_9_conv_bn_beta: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_9_conv_bn_moving_mean: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_9_conv_bn_moving_var: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_9_tower_conv_conv1_weight: Tensor[(384, 1280, 1, 1), float32] /* ty=Tensor[(384, 1280, 1, 1), float32] */, %mixed_9_tower_conv_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_conv_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_conv_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_conv_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_mixed_conv_conv1_weight: Tensor[(384, 384, 1, 3), float32] /* ty=Tensor[(384, 384, 1, 3), float32] */, %mixed_9_tower_mixed_conv_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_mixed_conv_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_mixed_conv_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_mixed_conv_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_mixed_conv_1_conv1_weight: Tensor[(384, 384, 3, 1), float32] /* ty=Tensor[(384, 384, 3, 1), float32] */, %mixed_9_tower_mixed_conv_1_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_mixed_conv_1_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_mixed_conv_1_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_mixed_conv_1_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_conv_conv1_weight: Tensor[(448, 1280, 1, 1), float32] /* ty=Tensor[(448, 1280, 1, 1), float32] */, %mixed_9_tower_1_conv_bn_gamma: Tensor[(448), float32] /* ty=Tensor[(448), float32] */, %mixed_9_tower_1_conv_bn_beta: Tensor[(448), float32] /* ty=Tensor[(448), float32] */, %mixed_9_tower_1_conv_bn_moving_mean: Tensor[(448), float32] /* ty=Tensor[(448), float32] */, %mixed_9_tower_1_conv_bn_moving_var: Tensor[(448), float32] /* ty=Tensor[(448), float32] */, %mixed_9_tower_1_conv_1_conv1_weight: Tensor[(384, 448, 3, 3), float32] /* ty=Tensor[(384, 448, 3, 3), float32] */, %mixed_9_tower_1_conv_1_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_conv_1_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_conv_1_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_conv_1_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_mixed_conv_conv1_weight: Tensor[(384, 384, 1, 3), float32] /* ty=Tensor[(384, 384, 1, 3), float32] */, %mixed_9_tower_1_mixed_conv_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_mixed_conv_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_mixed_conv_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_mixed_conv_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_mixed_conv_1_conv1_weight: Tensor[(384, 384, 3, 1), float32] /* ty=Tensor[(384, 384, 3, 1), float32] */, %mixed_9_tower_1_mixed_conv_1_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_mixed_conv_1_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_mixed_conv_1_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_1_mixed_conv_1_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_9_tower_2_conv_conv1_weight: Tensor[(192, 1280, 1, 1), float32] /* ty=Tensor[(192, 1280, 1, 1), float32] */, %mixed_9_tower_2_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_9_tower_2_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_9_tower_2_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_9_tower_2_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_10_conv_conv1_weight: Tensor[(320, 2048, 1, 1), float32] /* ty=Tensor[(320, 2048, 1, 1), float32] */, %mixed_10_conv_bn_gamma: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_10_conv_bn_beta: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_10_conv_bn_moving_mean: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_10_conv_bn_moving_var: Tensor[(320), float32] /* ty=Tensor[(320), float32] */, %mixed_10_tower_conv_conv1_weight: Tensor[(384, 2048, 1, 1), float32] /* ty=Tensor[(384, 2048, 1, 1), float32] */, %mixed_10_tower_conv_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_conv_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_conv_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_conv_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_mixed_conv_conv1_weight: Tensor[(384, 384, 1, 3), float32] /* ty=Tensor[(384, 384, 1, 3), float32] */, %mixed_10_tower_mixed_conv_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_mixed_conv_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_mixed_conv_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_mixed_conv_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_mixed_conv_1_conv1_weight: Tensor[(384, 384, 3, 1), float32] /* ty=Tensor[(384, 384, 3, 1), float32] */, %mixed_10_tower_mixed_conv_1_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_mixed_conv_1_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_mixed_conv_1_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_mixed_conv_1_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_conv_conv1_weight: Tensor[(448, 2048, 1, 1), float32] /* ty=Tensor[(448, 2048, 1, 1), float32] */, %mixed_10_tower_1_conv_bn_gamma: Tensor[(448), float32] /* ty=Tensor[(448), float32] */, %mixed_10_tower_1_conv_bn_beta: Tensor[(448), float32] /* ty=Tensor[(448), float32] */, %mixed_10_tower_1_conv_bn_moving_mean: Tensor[(448), float32] /* ty=Tensor[(448), float32] */, %mixed_10_tower_1_conv_bn_moving_var: Tensor[(448), float32] /* ty=Tensor[(448), float32] */, %mixed_10_tower_1_conv_1_conv1_weight: Tensor[(384, 448, 3, 3), float32] /* ty=Tensor[(384, 448, 3, 3), float32] */, %mixed_10_tower_1_conv_1_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_conv_1_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_conv_1_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_conv_1_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_mixed_conv_conv1_weight: Tensor[(384, 384, 1, 3), float32] /* ty=Tensor[(384, 384, 1, 3), float32] */, %mixed_10_tower_1_mixed_conv_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_mixed_conv_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_mixed_conv_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_mixed_conv_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_mixed_conv_1_conv1_weight: Tensor[(384, 384, 3, 1), float32] /* ty=Tensor[(384, 384, 3, 1), float32] */, %mixed_10_tower_1_mixed_conv_1_bn_gamma: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_mixed_conv_1_bn_beta: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_mixed_conv_1_bn_moving_mean: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_1_mixed_conv_1_bn_moving_var: Tensor[(384), float32] /* ty=Tensor[(384), float32] */, %mixed_10_tower_2_conv_conv1_weight: Tensor[(192, 2048, 1, 1), float32] /* ty=Tensor[(192, 2048, 1, 1), float32] */, %mixed_10_tower_2_conv_bn_gamma: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_10_tower_2_conv_bn_beta: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_10_tower_2_conv_bn_moving_mean: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %mixed_10_tower_2_conv_bn_moving_var: Tensor[(192), float32] /* ty=Tensor[(192), float32] */, %fc1_weight: Tensor[(1000, 2048), float32] /* ty=Tensor[(1000, 2048), float32] */, %fc2_bias: Tensor[(1000), float32] /* ty=Tensor[(1000), float32] */) -> Tensor[(1024, 1000), float32] {
  
  %20 = nn.relu(%19) /* ty=Tensor[(1024, 192, 71, 71), float32] */;
  %21 = nn.max_pool2d(%20, pool_size=[3, 3], strides=[2, 2], padding=[0, 0, 0, 0]) /* ty=Tensor[(1024, 192, 35, 35), float32] */;

  %22 = nn.conv2d(%21, %mixed_conv_conv1_weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1024, 64, 35, 35), float32] */;
  %23 = nn.batch_norm(%22, %mixed_conv_bn_gamma, %mixed_conv_bn_beta, %mixed_conv_bn_moving_mean, %mixed_conv_bn_moving_var, epsilon=2e-05f, scale=False) /* ty=(Tensor[(1024, 64, 35, 35), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %24 = %23.0 /* ty=Tensor[(1024, 64, 35, 35), float32] */;

  %25 = nn.conv2d(%21, %mixed_tower_conv_conv1_weight, padding=[0, 0, 0, 0], channels=48, kernel_size=[1, 1]) /* ty=Tensor[(1024, 48, 35, 35), float32] */;
  %26 = nn.batch_norm(%25, %mixed_tower_conv_bn_gamma, %mixed_tower_conv_bn_beta, %mixed_tower_conv_bn_moving_mean, %mixed_tower_conv_bn_moving_var, epsilon=2e-05f, scale=False) /* ty=(Tensor[(1024, 48, 35, 35), float32], Tensor[(48), float32], Tensor[(48), float32]) */;
  %27 = %26.0 /* ty=Tensor[(1024, 48, 35, 35), float32] */;
  %28 = nn.relu(%27) /* ty=Tensor[(1024, 48, 35, 35), float32] */;

  %29 = nn.conv2d(%28, %mixed_tower_conv_1_conv1_weight, padding=[2, 2, 2, 2], channels=64, kernel_size=[5, 5]) /* ty=Tensor[(1024, 64, 35, 35), float32] */;
  %30 = nn.batch_norm(%29, %mixed_tower_conv_1_bn_gamma, %mixed_tower_conv_1_bn_beta, %mixed_tower_conv_1_bn_moving_mean, %mixed_tower_conv_1_bn_moving_var, epsilon=2e-05f, scale=False) /* ty=(Tensor[(1024, 64, 35, 35), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %31 = %30.0 /* ty=Tensor[(1024, 64, 35, 35), float32] */;

  %32 = nn.conv2d(%21, %mixed_tower_1_conv_conv1_weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1024, 64, 35, 35), float32] */;
  %33 = nn.batch_norm(%32, %mixed_tower_1_conv_bn_gamma, %mixed_tower_1_conv_bn_beta, %mixed_tower_1_conv_bn_moving_mean, %mixed_tower_1_conv_bn_moving_var, epsilon=2e-05f, scale=False) /* ty=(Tensor[(1024, 64, 35, 35), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %34 = %33.0 /* ty=Tensor[(1024, 64, 35, 35), float32] */;
  %35 = nn.relu(%34) /* ty=Tensor[(1024, 64, 35, 35), float32] */;

  %36 = nn.conv2d(%35, %mixed_tower_1_conv_1_conv1_weight, padding=[1, 1, 1, 1], channels=96, kernel_size=[3, 3]) /* ty=Tensor[(1024, 96, 35, 35), float32] */;
  %37 = nn.batch_norm(%36, %mixed_tower_1_conv_1_bn_gamma, %mixed_tower_1_conv_1_bn_beta, %mixed_tower_1_conv_1_bn_moving_mean, %mixed_tower_1_conv_1_bn_moving_var, epsilon=2e-05f, scale=False) /* ty=(Tensor[(1024, 96, 35, 35), float32], Tensor[(96), float32], Tensor[(96), float32]) */;
  %38 = %37.0 /* ty=Tensor[(1024, 96, 35, 35), float32] */;
  %39 = nn.relu(%38) /* ty=Tensor[(1024, 96, 35, 35), float32] */;

  %40 = nn.conv2d(%39, %mixed_tower_1_conv_2_conv1_weight, padding=[1, 1, 1, 1], channels=96, kernel_size=[3, 3]) /* ty=Tensor[(1024, 96, 35, 35), float32] */;
  %41 = nn.batch_norm(%40, %mixed_tower_1_conv_2_bn_gamma, %mixed_tower_1_conv_2_bn_beta, %mixed_tower_1_conv_2_bn_moving_mean, %mixed_tower_1_conv_2_bn_moving_var, epsilon=2e-05f, scale=False) /* ty=(Tensor[(1024, 96, 35, 35), float32], Tensor[(96), float32], Tensor[(96), float32]) */;
  %42 = %41.0 /* ty=Tensor[(1024, 96, 35, 35), float32] */;
  %43 = nn.avg_pool2d(%21, pool_size=[3, 3], padding=[1, 1, 1, 1], count_include_pad=True) /* ty=Tensor[(1024, 192, 35, 35), float32] */;

  %44 = nn.conv2d(%43, %mixed_tower_2_conv_conv1_weight, padding=[0, 0, 0, 0], channels=32, kernel_size=[1, 1]) /* ty=Tensor[(1024, 32, 35, 35), float32] */;
  %45 = nn.batch_norm(%44, %mixed_tower_2_conv_bn_gamma, %mixed_tower_2_conv_bn_beta, %mixed_tower_2_conv_bn_moving_mean, %mixed_tower_2_conv_bn_moving_var, epsilon=2e-05f, scale=False) /* ty=(Tensor[(1024, 32, 35, 35), float32], Tensor[(32), float32], Tensor[(32), float32]) */;
  %46 = %45.0 /* ty=Tensor[(1024, 32, 35, 35), float32] */;
  %47 = nn.relu(%24) /* ty=Tensor[(1024, 64, 35, 35), float32] */;
  %48 = nn.relu(%31) /* ty=Tensor[(1024, 64, 35, 35), float32] */;
  %49 = nn.relu(%42) /* ty=Tensor[(1024, 96, 35, 35), float32] */;
  %50 = nn.relu(%46) /* ty=Tensor[(1024, 32, 35, 35), float32] */;
  %51 = (%47, %48, %49, %50) /* ty=(Tensor[(1024, 64, 35, 35), float32], Tensor[(1024, 64, 35, 35), float32], Tensor[(1024, 96, 35, 35), float32], Tensor[(1024, 32, 35, 35), float32]) */;
  %52 = concatenate(%51, axis=1) /* ty=Tensor[(1024, 256, 35, 35), float32] */;

  %53 = nn.conv2d(%52, %mixed_1_conv_conv1_weight, padding=[0, 0, 0, 0], channels=64, kernel_size=[1, 1]) /* ty=Tensor[(1024, 64, 35, 35), float32] */;
  %54 = nn.batch_norm(%53, %mixed_1_conv_bn_gamma, %mixed_1_conv_bn_beta, %mixed_1_conv_bn_moving_mean, %mixed_1_conv_bn_moving_var, epsilon=2e-05f, scale=False) /* ty=(Tensor[(1024, 64, 35, 35), float32], Tensor[(64), float32], Tensor[(64), float32]) */;
  %55 = %54.0 /* ty=Tensor[(1024, 64, 35, 35), float32] */;

  %56 = nn.conv2d(%52, %mixed_1_tower_conv_conv1_weight, padding=[0, 0, 0, 0], channels=48, kernel_size=[1, 1]) /* ty=Tensor[(1024, 48, 35, 35), float32] */;
  %57 = nn.batch_norm(%56, %mixed_1_tower_conv_bn_gamma, %mixed_1_tower_conv_bn_beta, %mixed_1_tower_conv_bn_moving_mean, %mixed_1_tower_conv_bn_moving_var, epsilon=2e-05f, scale=False) /* ty=(Tensor[(1024, 48, 35, 35), float32], Tensor[(48), float32], Tensor[(48), float32]) */;
  %58 = %57.0 /* ty=Tensor[(1024, 48, 35, 35), float32] */;
  %59 = nn.relu(%58) /* ty=Tensor[(1024, 48, 35, 35), float32] */;

