def @main(%input_ids: Tensor[(1, 512), int64] /* ty=Tensor[(1, 512), int64] span=/transformer/Reshape.input_ids:0:0 */, %transformer.wte.weight: Tensor[(50257, 768), float32] /* ty=Tensor[(50257, 768), float32] span=/transformer/wte/Gather.transformer.wte.weight:0:0 */, %transformer.wpe.weight: Tensor[(1024, 768), float32] /* ty=Tensor[(1024, 768), float32] span=/transformer/wpe/Gather.transformer.wpe.weight:0:0 */, %transformer.h.0.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.0/ln_1/LayerNormalization.transformer.h.0.ln_1.weight:0:0 */, %transformer.h.0.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.0/ln_1/LayerNormalization.transformer.h.0.ln_1.bias:0:0 */, %transformer.h.0.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.0/attn/c_attn/Gemm.transformer.h.0.attn.c_attn.weight:0:0 */, %transformer.h.0.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.0/attn/c_attn/Gemm.transformer.h.0.attn.c_attn.bias:0:0 */, %transformer.h.0.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.0/attn/c_proj/Gemm.transformer.h.0.attn.c_proj.weight:0:0 */, %transformer.h.0.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.0/attn/c_proj/Gemm.transformer.h.0.attn.c_proj.bias:0:0 */, %transformer.h.0.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.0/ln_2/LayerNormalization.transformer.h.0.ln_2.weight:0:0 */, %transformer.h.0.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.0/ln_2/LayerNormalization.transformer.h.0.ln_2.bias:0:0 */, %transformer.h.0.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.0/mlp/c_fc/Gemm.transformer.h.0.mlp.c_fc.weight:0:0 */, %transformer.h.0.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.0/mlp/c_fc/Gemm.transformer.h.0.mlp.c_fc.bias:0:0 */, %transformer.h.0.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.0/mlp/c_proj/Gemm.transformer.h.0.mlp.c_proj.weight:0:0 */, %transformer.h.0.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.0/mlp/c_proj/Gemm.transformer.h.0.mlp.c_proj.bias:0:0 */, %transformer.h.1.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.1/ln_1/LayerNormalization.transformer.h.1.ln_1.weight:0:0 */, %transformer.h.1.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.1/ln_1/LayerNormalization.transformer.h.1.ln_1.bias:0:0 */, %transformer.h.1.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.1/attn/c_attn/Gemm.transformer.h.1.attn.c_attn.weight:0:0 */, %transformer.h.1.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.1/attn/c_attn/Gemm.transformer.h.1.attn.c_attn.bias:0:0 */, %transformer.h.1.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.1/attn/c_proj/Gemm.transformer.h.1.attn.c_proj.weight:0:0 */, %transformer.h.1.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.1/attn/c_proj/Gemm.transformer.h.1.attn.c_proj.bias:0:0 */, %transformer.h.1.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.1/ln_2/LayerNormalization.transformer.h.1.ln_2.weight:0:0 */, %transformer.h.1.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.1/ln_2/LayerNormalization.transformer.h.1.ln_2.bias:0:0 */, %transformer.h.1.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.1/mlp/c_fc/Gemm.transformer.h.1.mlp.c_fc.weight:0:0 */, %transformer.h.1.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.1/mlp/c_fc/Gemm.transformer.h.1.mlp.c_fc.bias:0:0 */, %transformer.h.1.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.1/mlp/c_proj/Gemm.transformer.h.1.mlp.c_proj.weight:0:0 */, %transformer.h.1.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.1/mlp/c_proj/Gemm.transformer.h.1.mlp.c_proj.bias:0:0 */, %transformer.h.2.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.2/ln_1/LayerNormalization.transformer.h.2.ln_1.weight:0:0 */, %transformer.h.2.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.2/ln_1/LayerNormalization.transformer.h.2.ln_1.bias:0:0 */, %transformer.h.2.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.2/attn/c_attn/Gemm.transformer.h.2.attn.c_attn.weight:0:0 */, %transformer.h.2.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.2/attn/c_attn/Gemm.transformer.h.2.attn.c_attn.bias:0:0 */, %transformer.h.2.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.2/attn/c_proj/Gemm.transformer.h.2.attn.c_proj.weight:0:0 */, %transformer.h.2.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.2/attn/c_proj/Gemm.transformer.h.2.attn.c_proj.bias:0:0 */, %transformer.h.2.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.2/ln_2/LayerNormalization.transformer.h.2.ln_2.weight:0:0 */, %transformer.h.2.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.2/ln_2/LayerNormalization.transformer.h.2.ln_2.bias:0:0 */, %transformer.h.2.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.2/mlp/c_fc/Gemm.transformer.h.2.mlp.c_fc.weight:0:0 */, %transformer.h.2.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.2/mlp/c_fc/Gemm.transformer.h.2.mlp.c_fc.bias:0:0 */, %transformer.h.2.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.2/mlp/c_proj/Gemm.transformer.h.2.mlp.c_proj.weight:0:0 */, %transformer.h.2.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.2/mlp/c_proj/Gemm.transformer.h.2.mlp.c_proj.bias:0:0 */, %transformer.h.3.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.3/ln_1/LayerNormalization.transformer.h.3.ln_1.weight:0:0 */, %transformer.h.3.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.3/ln_1/LayerNormalization.transformer.h.3.ln_1.bias:0:0 */, %transformer.h.3.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.3/attn/c_attn/Gemm.transformer.h.3.attn.c_attn.weight:0:0 */, %transformer.h.3.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.3/attn/c_attn/Gemm.transformer.h.3.attn.c_attn.bias:0:0 */, %transformer.h.3.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.3/attn/c_proj/Gemm.transformer.h.3.attn.c_proj.weight:0:0 */, %transformer.h.3.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.3/attn/c_proj/Gemm.transformer.h.3.attn.c_proj.bias:0:0 */, %transformer.h.3.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.3/ln_2/LayerNormalization.transformer.h.3.ln_2.weight:0:0 */, %transformer.h.3.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.3/ln_2/LayerNormalization.transformer.h.3.ln_2.bias:0:0 */, %transformer.h.3.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.3/mlp/c_fc/Gemm.transformer.h.3.mlp.c_fc.weight:0:0 */, %transformer.h.3.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.3/mlp/c_fc/Gemm.transformer.h.3.mlp.c_fc.bias:0:0 */, %transformer.h.3.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.3/mlp/c_proj/Gemm.transformer.h.3.mlp.c_proj.weight:0:0 */, %transformer.h.3.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.3/mlp/c_proj/Gemm.transformer.h.3.mlp.c_proj.bias:0:0 */, %transformer.h.4.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.4/ln_1/LayerNormalization.transformer.h.4.ln_1.weight:0:0 */, %transformer.h.4.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.4/ln_1/LayerNormalization.transformer.h.4.ln_1.bias:0:0 */, %transformer.h.4.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.4/attn/c_attn/Gemm.transformer.h.4.attn.c_attn.weight:0:0 */, %transformer.h.4.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.4/attn/c_attn/Gemm.transformer.h.4.attn.c_attn.bias:0:0 */, %transformer.h.4.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.4/attn/c_proj/Gemm.transformer.h.4.attn.c_proj.weight:0:0 */, %transformer.h.4.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.4/attn/c_proj/Gemm.transformer.h.4.attn.c_proj.bias:0:0 */, %transformer.h.4.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.4/ln_2/LayerNormalization.transformer.h.4.ln_2.weight:0:0 */, %transformer.h.4.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.4/ln_2/LayerNormalization.transformer.h.4.ln_2.bias:0:0 */, %transformer.h.4.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.4/mlp/c_fc/Gemm.transformer.h.4.mlp.c_fc.weight:0:0 */, %transformer.h.4.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.4/mlp/c_fc/Gemm.transformer.h.4.mlp.c_fc.bias:0:0 */, %transformer.h.4.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.4/mlp/c_proj/Gemm.transformer.h.4.mlp.c_proj.weight:0:0 */, %transformer.h.4.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.4/mlp/c_proj/Gemm.transformer.h.4.mlp.c_proj.bias:0:0 */, %transformer.h.5.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.5/ln_1/LayerNormalization.transformer.h.5.ln_1.weight:0:0 */, %transformer.h.5.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.5/ln_1/LayerNormalization.transformer.h.5.ln_1.bias:0:0 */, %transformer.h.5.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.5/attn/c_attn/Gemm.transformer.h.5.attn.c_attn.weight:0:0 */, %transformer.h.5.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.5/attn/c_attn/Gemm.transformer.h.5.attn.c_attn.bias:0:0 */, %transformer.h.5.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.5/attn/c_proj/Gemm.transformer.h.5.attn.c_proj.weight:0:0 */, %transformer.h.5.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.5/attn/c_proj/Gemm.transformer.h.5.attn.c_proj.bias:0:0 */, %transformer.h.5.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.5/ln_2/LayerNormalization.transformer.h.5.ln_2.weight:0:0 */, %transformer.h.5.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.5/ln_2/LayerNormalization.transformer.h.5.ln_2.bias:0:0 */, %transformer.h.5.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.5/mlp/c_fc/Gemm.transformer.h.5.mlp.c_fc.weight:0:0 */, %transformer.h.5.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.5/mlp/c_fc/Gemm.transformer.h.5.mlp.c_fc.bias:0:0 */, %transformer.h.5.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.5/mlp/c_proj/Gemm.transformer.h.5.mlp.c_proj.weight:0:0 */, %transformer.h.5.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.5/mlp/c_proj/Gemm.transformer.h.5.mlp.c_proj.bias:0:0 */, %transformer.h.6.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.6/ln_1/LayerNormalization.transformer.h.6.ln_1.weight:0:0 */, %transformer.h.6.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.6/ln_1/LayerNormalization.transformer.h.6.ln_1.bias:0:0 */, %transformer.h.6.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.6/attn/c_attn/Gemm.transformer.h.6.attn.c_attn.weight:0:0 */, %transformer.h.6.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.6/attn/c_attn/Gemm.transformer.h.6.attn.c_attn.bias:0:0 */, %transformer.h.6.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.6/attn/c_proj/Gemm.transformer.h.6.attn.c_proj.weight:0:0 */, %transformer.h.6.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.6/attn/c_proj/Gemm.transformer.h.6.attn.c_proj.bias:0:0 */, %transformer.h.6.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.6/ln_2/LayerNormalization.transformer.h.6.ln_2.weight:0:0 */, %transformer.h.6.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.6/ln_2/LayerNormalization.transformer.h.6.ln_2.bias:0:0 */, %transformer.h.6.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.6/mlp/c_fc/Gemm.transformer.h.6.mlp.c_fc.weight:0:0 */, %transformer.h.6.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.6/mlp/c_fc/Gemm.transformer.h.6.mlp.c_fc.bias:0:0 */, %transformer.h.6.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.6/mlp/c_proj/Gemm.transformer.h.6.mlp.c_proj.weight:0:0 */, %transformer.h.6.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.6/mlp/c_proj/Gemm.transformer.h.6.mlp.c_proj.bias:0:0 */, %transformer.h.7.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.7/ln_1/LayerNormalization.transformer.h.7.ln_1.weight:0:0 */, %transformer.h.7.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.7/ln_1/LayerNormalization.transformer.h.7.ln_1.bias:0:0 */, %transformer.h.7.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.7/attn/c_attn/Gemm.transformer.h.7.attn.c_attn.weight:0:0 */, %transformer.h.7.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.7/attn/c_attn/Gemm.transformer.h.7.attn.c_attn.bias:0:0 */, %transformer.h.7.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.7/attn/c_proj/Gemm.transformer.h.7.attn.c_proj.weight:0:0 */, %transformer.h.7.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.7/attn/c_proj/Gemm.transformer.h.7.attn.c_proj.bias:0:0 */, %transformer.h.7.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.7/ln_2/LayerNormalization.transformer.h.7.ln_2.weight:0:0 */, %transformer.h.7.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.7/ln_2/LayerNormalization.transformer.h.7.ln_2.bias:0:0 */, %transformer.h.7.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.7/mlp/c_fc/Gemm.transformer.h.7.mlp.c_fc.weight:0:0 */, %transformer.h.7.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.7/mlp/c_fc/Gemm.transformer.h.7.mlp.c_fc.bias:0:0 */, %transformer.h.7.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.7/mlp/c_proj/Gemm.transformer.h.7.mlp.c_proj.weight:0:0 */, %transformer.h.7.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.7/mlp/c_proj/Gemm.transformer.h.7.mlp.c_proj.bias:0:0 */, %transformer.h.8.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.8/ln_1/LayerNormalization.transformer.h.8.ln_1.weight:0:0 */, %transformer.h.8.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.8/ln_1/LayerNormalization.transformer.h.8.ln_1.bias:0:0 */, %transformer.h.8.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.8/attn/c_attn/Gemm.transformer.h.8.attn.c_attn.weight:0:0 */, %transformer.h.8.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.8/attn/c_attn/Gemm.transformer.h.8.attn.c_attn.bias:0:0 */, %transformer.h.8.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.8/attn/c_proj/Gemm.transformer.h.8.attn.c_proj.weight:0:0 */, %transformer.h.8.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.8/attn/c_proj/Gemm.transformer.h.8.attn.c_proj.bias:0:0 */, %transformer.h.8.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.8/ln_2/LayerNormalization.transformer.h.8.ln_2.weight:0:0 */, %transformer.h.8.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.8/ln_2/LayerNormalization.transformer.h.8.ln_2.bias:0:0 */, %transformer.h.8.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.8/mlp/c_fc/Gemm.transformer.h.8.mlp.c_fc.weight:0:0 */, %transformer.h.8.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.8/mlp/c_fc/Gemm.transformer.h.8.mlp.c_fc.bias:0:0 */, %transformer.h.8.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.8/mlp/c_proj/Gemm.transformer.h.8.mlp.c_proj.weight:0:0 */, %transformer.h.8.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.8/mlp/c_proj/Gemm.transformer.h.8.mlp.c_proj.bias:0:0 */, %transformer.h.9.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.9/ln_1/LayerNormalization.transformer.h.9.ln_1.weight:0:0 */, %transformer.h.9.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.9/ln_1/LayerNormalization.transformer.h.9.ln_1.bias:0:0 */, %transformer.h.9.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.9/attn/c_attn/Gemm.transformer.h.9.attn.c_attn.weight:0:0 */, %transformer.h.9.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.9/attn/c_attn/Gemm.transformer.h.9.attn.c_attn.bias:0:0 */, %transformer.h.9.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.9/attn/c_proj/Gemm.transformer.h.9.attn.c_proj.weight:0:0 */, %transformer.h.9.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.9/attn/c_proj/Gemm.transformer.h.9.attn.c_proj.bias:0:0 */, %transformer.h.9.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.9/ln_2/LayerNormalization.transformer.h.9.ln_2.weight:0:0 */, %transformer.h.9.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.9/ln_2/LayerNormalization.transformer.h.9.ln_2.bias:0:0 */, %transformer.h.9.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.9/mlp/c_fc/Gemm.transformer.h.9.mlp.c_fc.weight:0:0 */, %transformer.h.9.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.9/mlp/c_fc/Gemm.transformer.h.9.mlp.c_fc.bias:0:0 */, %transformer.h.9.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.9/mlp/c_proj/Gemm.transformer.h.9.mlp.c_proj.weight:0:0 */, %transformer.h.9.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.9/mlp/c_proj/Gemm.transformer.h.9.mlp.c_proj.bias:0:0 */, %transformer.h.10.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.10/ln_1/LayerNormalization.transformer.h.10.ln_1.weight:0:0 */, %transformer.h.10.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.10/ln_1/LayerNormalization.transformer.h.10.ln_1.bias:0:0 */, %transformer.h.10.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.10/attn/c_attn/Gemm.transformer.h.10.attn.c_attn.weight:0:0 */, %transformer.h.10.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.10/attn/c_attn/Gemm.transformer.h.10.attn.c_attn.bias:0:0 */, %transformer.h.10.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.10/attn/c_proj/Gemm.transformer.h.10.attn.c_proj.weight:0:0 */, %transformer.h.10.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.10/attn/c_proj/Gemm.transformer.h.10.attn.c_proj.bias:0:0 */, %transformer.h.10.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.10/ln_2/LayerNormalization.transformer.h.10.ln_2.weight:0:0 */, %transformer.h.10.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.10/ln_2/LayerNormalization.transformer.h.10.ln_2.bias:0:0 */, %transformer.h.10.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.10/mlp/c_fc/Gemm.transformer.h.10.mlp.c_fc.weight:0:0 */, %transformer.h.10.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.10/mlp/c_fc/Gemm.transformer.h.10.mlp.c_fc.bias:0:0 */, %transformer.h.10.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.10/mlp/c_proj/Gemm.transformer.h.10.mlp.c_proj.weight:0:0 */, %transformer.h.10.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.10/mlp/c_proj/Gemm.transformer.h.10.mlp.c_proj.bias:0:0 */, %transformer.h.11.ln_1.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.11/ln_1/LayerNormalization.transformer.h.11.ln_1.weight:0:0 */, %transformer.h.11.ln_1.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.11/ln_1/LayerNormalization.transformer.h.11.ln_1.bias:0:0 */, %transformer.h.11.attn.c_attn.weight: Tensor[(768, 2304), float32] /* ty=Tensor[(768, 2304), float32] span=/transformer/h.11/attn/c_attn/Gemm.transformer.h.11.attn.c_attn.weight:0:0 */, %transformer.h.11.attn.c_attn.bias: Tensor[(2304), float32] /* ty=Tensor[(2304), float32] span=/transformer/h.11/attn/c_attn/Gemm.transformer.h.11.attn.c_attn.bias:0:0 */, %transformer.h.11.attn.c_proj.weight: Tensor[(768, 768), float32] /* ty=Tensor[(768, 768), float32] span=/transformer/h.11/attn/c_proj/Gemm.transformer.h.11.attn.c_proj.weight:0:0 */, %transformer.h.11.attn.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.11/attn/c_proj/Gemm.transformer.h.11.attn.c_proj.bias:0:0 */, %transformer.h.11.ln_2.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.11/ln_2/LayerNormalization.transformer.h.11.ln_2.weight:0:0 */, %transformer.h.11.ln_2.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.11/ln_2/LayerNormalization.transformer.h.11.ln_2.bias:0:0 */, %transformer.h.11.mlp.c_fc.weight: Tensor[(768, 3072), float32] /* ty=Tensor[(768, 3072), float32] span=/transformer/h.11/mlp/c_fc/Gemm.transformer.h.11.mlp.c_fc.weight:0:0 */, %transformer.h.11.mlp.c_fc.bias: Tensor[(3072), float32] /* ty=Tensor[(3072), float32] span=/transformer/h.11/mlp/c_fc/Gemm.transformer.h.11.mlp.c_fc.bias:0:0 */, %transformer.h.11.mlp.c_proj.weight: Tensor[(3072, 768), float32] /* ty=Tensor[(3072, 768), float32] span=/transformer/h.11/mlp/c_proj/Gemm.transformer.h.11.mlp.c_proj.weight:0:0 */, %transformer.h.11.mlp.c_proj.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/h.11/mlp/c_proj/Gemm.transformer.h.11.mlp.c_proj.bias:0:0 */, %transformer.ln_f.weight: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/ln_f/LayerNormalization.transformer.ln_f.weight:0:0 */, %transformer.ln_f.bias: Tensor[(768), float32] /* ty=Tensor[(768), float32] span=/transformer/ln_f/LayerNormalization.transformer.ln_f.bias:0:0 */, %onnx::MatMul_2714: Tensor[(768, 50257), float32] /* ty=Tensor[(768, 50257), float32] span=/lm_head/MatMul.onnx::MatMul_2714:0:0 */) -> (Tensor[(1, 512, 50257), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32], Tensor[(1, 12, 512, 64), float32]) {
  %0 = reshape(%input_ids, newshape=[-1, 512]) /* ty=Tensor[(1, 512), int64] span=/transformer/Reshape:0:0 */;
  %1 = less(%0, 0i64 /* ty=int64 span=/transformer/wte/Gather:0:0 */) /* ty=Tensor[(1, 512), bool] span=/transformer/wte/Gather:0:0 */;
  %2 = add(%0, 50257i64 /* ty=int64 */) /* ty=Tensor[(1, 512), int64] span=/transformer/wte/Gather:0:0 */;
  %3 = where(%1, %2, %0) /* ty=Tensor[(1, 512), int64] span=/transformer/wte/Gather:0:0 */;
  %4 = take(%transformer.wte.weight, %3, axis=0) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/wte/Gather:0:0 */;
  %5 = take(%transformer.wpe.weight, meta[relay.Constant][0] /* ty=Tensor[(1, 512), int64] */, axis=0) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/wpe/Gather:0:0 */;
  %6 = add(%4, %5) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/Add:0:0 */;
  %7 = mean(%6, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_1/LayerNormalization:0:0 */;
  %8 = variance(%6, %7, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_1/LayerNormalization:0:0 */;
  %9 = add(%8, 1e-05f /* ty=float32 span=/transformer/h.0/ln_1/LayerNormalization:0:0 */) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_1/LayerNormalization:0:0 */;
  %10 = sqrt(%9) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_1/LayerNormalization:0:0 */;
  %11 = subtract(%6, %7) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/ln_1/LayerNormalization:0:0 */;
  %12 = divide(1f /* ty=float32 span=/transformer/h.0/ln_1/LayerNormalization:0:0 */, %10) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_1/LayerNormalization:0:0 */;
  %13 = multiply(%11, %12) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/ln_1/LayerNormalization:0:0 */;
  %14 = multiply(%13, %transformer.h.0.ln_1.weight) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/ln_1/LayerNormalization:0:0 */;
  %15 = add(%14, %transformer.h.0.ln_1.bias) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/ln_1/LayerNormalization:0:0 */;
  %16 = reshape(%15, newshape=[-1, 768]) /* ty=Tensor[(512, 768), float32] span=/transformer/h.0/attn/c_attn/Reshape:0:0 */;
  %17 = transpose(%transformer.h.0.attn.c_attn.weight, axes=[1, 0]) /* ty=Tensor[(2304, 768), float32] span=/transformer/h.0/attn/c_attn/Gemm:0:0 */;
  %18 = nn.dense(%16, %17, units=2304) /* ty=Tensor[(512, 2304), float32] span=/transformer/h.0/attn/c_attn/Gemm:0:0 */;
  %19 = add(%18, %transformer.h.0.attn.c_attn.bias) /* ty=Tensor[(512, 2304), float32] span=/transformer/h.0/attn/c_attn/Gemm:0:0 */;
  %20 = reshape(%19, newshape=[1, 512, 2304]) /* ty=Tensor[(1, 512, 2304), float32] span=/transformer/h.0/attn/c_attn/Reshape_1:0:0 */;
  %21 = split(%20, indices_or_sections=[768i64, 1536i64], axis=2) /* ty=(Tensor[(1, 512, 768), float32], Tensor[(1, 512, 768), float32], Tensor[(1, 512, 768), float32]) span=/transformer/h.0/attn/Split:0:0 */;
  %22 = %21.0 /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/attn/Split:0:0 */;
  %23 = reshape(%22, newshape=[1, 512, 12, 64]) /* ty=Tensor[(1, 512, 12, 64), float32] span=/transformer/h.0/attn/Reshape:0:0 */;
  %24 = transpose(%23, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.0/attn/Transpose:0:0 */;
  %25 = multiply(%24, meta[relay.Constant][1] /* ty=Tensor[(1), float32] span=/transformer/h.0/attn/Sqrt_1:0:0 */) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.0/attn/Mul:0:0 */;
  %26 = %21.1 /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/attn/Split:0:0 */;
  %27 = reshape(%26, newshape=[1, 512, 12, 64]) /* ty=Tensor[(1, 512, 12, 64), float32] span=/transformer/h.0/attn/Reshape_1:0:0 */;
  %28 = transpose(%27, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 512), float32] span=/transformer/h.0/attn/Transpose_3:0:0 */;
  %29 = multiply(%28, meta[relay.Constant][2] /* ty=Tensor[(1), float32] span=/transformer/h.0/attn/Sqrt_2:0:0 */) /* ty=Tensor[(1, 12, 64, 512), float32] span=/transformer/h.0/attn/Mul_1:0:0 */;
  %30 = reshape(%29, newshape=[-1, 64, 512]) /* ty=Tensor[(12, 64, 512), float32] span=/transformer/h.0/attn/MatMul:0:0 */;
  %31 = reshape(%25, newshape=[-1, 512, 64]) /* ty=Tensor[(12, 512, 64), float32] span=/transformer/h.0/attn/MatMul:0:0 */;
  %32 = transpose(%30, axes=[0, 2, 1]) /* ty=Tensor[(12, 512, 64), float32] span=/transformer/h.0/attn/MatMul:0:0 */;
  %33 = nn.batch_matmul(%31, %32, out_dtype="float32", transpose_b=True) /* ty=Tensor[(12, 512, 512), float32] span=/transformer/h.0/attn/MatMul:0:0 */;
  %34 = reshape(%33, newshape=[1, 12, 512, 512]) /* ty=Tensor[(1, 12, 512, 512), float32] span=/transformer/h.0/attn/MatMul:0:0 */;
  %35 = add(%34, meta[relay.Constant][3] /* ty=Tensor[(1, 1, 512, 512), float32] span=/transformer/Expand:0:0 */) /* ty=Tensor[(1, 12, 512, 512), float32] span=/transformer/h.0/attn/Add:0:0 */;
  %36 = nn.softmax(%35, axis=3) /* ty=Tensor[(1, 12, 512, 512), float32] span=/transformer/h.0/attn/Softmax:0:0 */;
  %37 = %21.2 /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/attn/Split:0:0 */;
  %38 = reshape(%37, newshape=[1, 512, 12, 64]) /* ty=Tensor[(1, 512, 12, 64), float32] span=/transformer/h.0/attn/Reshape_2:0:0 */;
  %39 = transpose(%38, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.0/attn/Transpose_2:0:0 */;
  %40 = reshape(%39, newshape=[-1, 512, 64]) /* ty=Tensor[(12, 512, 64), float32] span=/transformer/h.0/attn/MatMul_1:0:0 */;
  %41 = reshape(%36, newshape=[-1, 512, 512]) /* ty=Tensor[(12, 512, 512), float32] span=/transformer/h.0/attn/MatMul_1:0:0 */;
  %42 = transpose(%40, axes=[0, 2, 1]) /* ty=Tensor[(12, 64, 512), float32] span=/transformer/h.0/attn/MatMul_1:0:0 */;
  %43 = nn.batch_matmul(%41, %42, out_dtype="float32", transpose_b=True) /* ty=Tensor[(12, 512, 64), float32] span=/transformer/h.0/attn/MatMul_1:0:0 */;
  %44 = reshape(%43, newshape=[1, 12, 512, 64]) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.0/attn/MatMul_1:0:0 */;
  %45 = transpose(%44, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 512, 12, 64), float32] span=/transformer/h.0/attn/Transpose_4:0:0 */;
  %46 = reshape(%45, newshape=[1, 512, 768]) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/attn/Reshape_3:0:0 */;
  %47 = reshape(%46, newshape=[-1, 768]) /* ty=Tensor[(512, 768), float32] span=/transformer/h.0/attn/c_proj/Reshape:0:0 */;
  %48 = transpose(%transformer.h.0.attn.c_proj.weight, axes=[1, 0]) /* ty=Tensor[(768, 768), float32] span=/transformer/h.0/attn/c_proj/Gemm:0:0 */;
  %49 = nn.dense(%47, %48, units=768) /* ty=Tensor[(512, 768), float32] span=/transformer/h.0/attn/c_proj/Gemm:0:0 */;
  %50 = add(%49, %transformer.h.0.attn.c_proj.bias) /* ty=Tensor[(512, 768), float32] span=/transformer/h.0/attn/c_proj/Gemm:0:0 */;
  %51 = reshape(%50, newshape=[1, 512, 768]) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/attn/c_proj/Reshape_1:0:0 */;
  %52 = add(%51, %6) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/Add:0:0 */;
  %53 = mean(%52, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_2/LayerNormalization:0:0 */;
  %54 = variance(%52, %53, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_2/LayerNormalization:0:0 */;
  %55 = add(%54, 1e-05f /* ty=float32 span=/transformer/h.0/ln_2/LayerNormalization:0:0 */) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_2/LayerNormalization:0:0 */;
  %56 = sqrt(%55) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_2/LayerNormalization:0:0 */;
  %57 = subtract(%52, %53) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/ln_2/LayerNormalization:0:0 */;
  %58 = divide(1f /* ty=float32 span=/transformer/h.0/ln_2/LayerNormalization:0:0 */, %56) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.0/ln_2/LayerNormalization:0:0 */;
  %59 = multiply(%57, %58) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/ln_2/LayerNormalization:0:0 */;
  %60 = multiply(%59, %transformer.h.0.ln_2.weight) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/ln_2/LayerNormalization:0:0 */;
  %61 = add(%60, %transformer.h.0.ln_2.bias) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/ln_2/LayerNormalization:0:0 */;
  %62 = reshape(%61, newshape=[-1, 768]) /* ty=Tensor[(512, 768), float32] span=/transformer/h.0/mlp/c_fc/Reshape:0:0 */;
  %63 = transpose(%transformer.h.0.mlp.c_fc.weight, axes=[1, 0]) /* ty=Tensor[(3072, 768), float32] span=/transformer/h.0/mlp/c_fc/Gemm:0:0 */;
  %64 = nn.dense(%62, %63, units=3072) /* ty=Tensor[(512, 3072), float32] span=/transformer/h.0/mlp/c_fc/Gemm:0:0 */;
  %65 = add(%64, %transformer.h.0.mlp.c_fc.bias) /* ty=Tensor[(512, 3072), float32] span=/transformer/h.0/mlp/c_fc/Gemm:0:0 */;
  %66 = reshape(%65, newshape=[1, 512, 3072]) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.0/mlp/c_fc/Reshape_1:0:0 */;
  %67 = power(%66, 3f /* ty=float32 span=/transformer/h.0/mlp/act/Constant_1:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.0/mlp/act/Pow:0:0 */;
  %68 = multiply(%67, 0.044715f /* ty=float32 span=/transformer/h.0/mlp/act/Constant_2:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.0/mlp/act/Mul_1:0:0 */;
  %69 = add(%66, %68) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.0/mlp/act/Add:0:0 */;
  %70 = multiply(%69, 0.797885f /* ty=float32 span=/transformer/h.0/mlp/act/Constant_3:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.0/mlp/act/Mul_2:0:0 */;
  %71 = tanh(%70) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.0/mlp/act/Tanh:0:0 */;
  %72 = multiply(%66, 0.5f /* ty=float32 span=/transformer/h.0/mlp/act/Constant:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.0/mlp/act/Mul:0:0 */;
  %73 = add(%71, 1f /* ty=float32 span=/transformer/h.0/mlp/act/Constant_4:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.0/mlp/act/Add_1:0:0 */;
  %74 = multiply(%72, %73) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.0/mlp/act/Mul_3:0:0 */;
  %75 = reshape(%74, newshape=[-1, 3072]) /* ty=Tensor[(512, 3072), float32] span=/transformer/h.0/mlp/c_proj/Reshape:0:0 */;
  %76 = transpose(%transformer.h.0.mlp.c_proj.weight, axes=[1, 0]) /* ty=Tensor[(768, 3072), float32] span=/transformer/h.0/mlp/c_proj/Gemm:0:0 */;
  %77 = nn.dense(%75, %76, units=768) /* ty=Tensor[(512, 768), float32] span=/transformer/h.0/mlp/c_proj/Gemm:0:0 */;
  %78 = add(%77, %transformer.h.0.mlp.c_proj.bias) /* ty=Tensor[(512, 768), float32] span=/transformer/h.0/mlp/c_proj/Gemm:0:0 */;
  %79 = reshape(%78, newshape=[1, 512, 768]) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/mlp/c_proj/Reshape_1:0:0 */;
  %80 = add(%52, %79) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.0/Add_1:0:0 */;
  %81 = mean(%80, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_1/LayerNormalization:0:0 */;
  %82 = variance(%80, %81, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_1/LayerNormalization:0:0 */;
  %83 = add(%82, 1e-05f /* ty=float32 span=/transformer/h.1/ln_1/LayerNormalization:0:0 */) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_1/LayerNormalization:0:0 */;
  %84 = sqrt(%83) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_1/LayerNormalization:0:0 */;
  %85 = subtract(%80, %81) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/ln_1/LayerNormalization:0:0 */;
  %86 = divide(1f /* ty=float32 span=/transformer/h.1/ln_1/LayerNormalization:0:0 */, %84) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_1/LayerNormalization:0:0 */;
  %87 = multiply(%85, %86) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/ln_1/LayerNormalization:0:0 */;
  %88 = multiply(%87, %transformer.h.1.ln_1.weight) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/ln_1/LayerNormalization:0:0 */;
  %89 = add(%88, %transformer.h.1.ln_1.bias) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/ln_1/LayerNormalization:0:0 */;
  %90 = reshape(%89, newshape=[-1, 768]) /* ty=Tensor[(512, 768), float32] span=/transformer/h.1/attn/c_attn/Reshape:0:0 */;
  %91 = transpose(%transformer.h.1.attn.c_attn.weight, axes=[1, 0]) /* ty=Tensor[(2304, 768), float32] span=/transformer/h.1/attn/c_attn/Gemm:0:0 */;
  %92 = nn.dense(%90, %91, units=2304) /* ty=Tensor[(512, 2304), float32] span=/transformer/h.1/attn/c_attn/Gemm:0:0 */;
  %93 = add(%92, %transformer.h.1.attn.c_attn.bias) /* ty=Tensor[(512, 2304), float32] span=/transformer/h.1/attn/c_attn/Gemm:0:0 */;
  %94 = reshape(%93, newshape=[1, 512, 2304]) /* ty=Tensor[(1, 512, 2304), float32] span=/transformer/h.1/attn/c_attn/Reshape_1:0:0 */;
  %95 = split(%94, indices_or_sections=[768i64, 1536i64], axis=2) /* ty=(Tensor[(1, 512, 768), float32], Tensor[(1, 512, 768), float32], Tensor[(1, 512, 768), float32]) span=/transformer/h.1/attn/Split:0:0 */;
  %96 = %95.0 /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/attn/Split:0:0 */;
  %97 = reshape(%96, newshape=[1, 512, 12, 64]) /* ty=Tensor[(1, 512, 12, 64), float32] span=/transformer/h.1/attn/Reshape:0:0 */;
  %98 = transpose(%97, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.1/attn/Transpose:0:0 */;
  %99 = multiply(%98, meta[relay.Constant][4] /* ty=Tensor[(1), float32] span=/transformer/h.1/attn/Sqrt_1:0:0 */) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.1/attn/Mul:0:0 */;
  %100 = %95.1 /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/attn/Split:0:0 */;
  %101 = reshape(%100, newshape=[1, 512, 12, 64]) /* ty=Tensor[(1, 512, 12, 64), float32] span=/transformer/h.1/attn/Reshape_1:0:0 */;
  %102 = transpose(%101, axes=[0, 2, 3, 1]) /* ty=Tensor[(1, 12, 64, 512), float32] span=/transformer/h.1/attn/Transpose_3:0:0 */;
  %103 = multiply(%102, meta[relay.Constant][5] /* ty=Tensor[(1), float32] span=/transformer/h.1/attn/Sqrt_2:0:0 */) /* ty=Tensor[(1, 12, 64, 512), float32] span=/transformer/h.1/attn/Mul_1:0:0 */;
  %104 = reshape(%103, newshape=[-1, 64, 512]) /* ty=Tensor[(12, 64, 512), float32] span=/transformer/h.1/attn/MatMul:0:0 */;
  %105 = reshape(%99, newshape=[-1, 512, 64]) /* ty=Tensor[(12, 512, 64), float32] span=/transformer/h.1/attn/MatMul:0:0 */;
  %106 = transpose(%104, axes=[0, 2, 1]) /* ty=Tensor[(12, 512, 64), float32] span=/transformer/h.1/attn/MatMul:0:0 */;
  %107 = nn.batch_matmul(%105, %106, out_dtype="float32", transpose_b=True) /* ty=Tensor[(12, 512, 512), float32] span=/transformer/h.1/attn/MatMul:0:0 */;
  %108 = reshape(%107, newshape=[1, 12, 512, 512]) /* ty=Tensor[(1, 12, 512, 512), float32] span=/transformer/h.1/attn/MatMul:0:0 */;
  %109 = add(%108, meta[relay.Constant][3] /* ty=Tensor[(1, 1, 512, 512), float32] span=/transformer/Expand:0:0 */) /* ty=Tensor[(1, 12, 512, 512), float32] span=/transformer/h.1/attn/Add:0:0 */;
  %110 = nn.softmax(%109, axis=3) /* ty=Tensor[(1, 12, 512, 512), float32] span=/transformer/h.1/attn/Softmax:0:0 */;
  %111 = %95.2 /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/attn/Split:0:0 */;
  %112 = reshape(%111, newshape=[1, 512, 12, 64]) /* ty=Tensor[(1, 512, 12, 64), float32] span=/transformer/h.1/attn/Reshape_2:0:0 */;
  %113 = transpose(%112, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.1/attn/Transpose_2:0:0 */;
  %114 = reshape(%113, newshape=[-1, 512, 64]) /* ty=Tensor[(12, 512, 64), float32] span=/transformer/h.1/attn/MatMul_1:0:0 */;
  %115 = reshape(%110, newshape=[-1, 512, 512]) /* ty=Tensor[(12, 512, 512), float32] span=/transformer/h.1/attn/MatMul_1:0:0 */;
  %116 = transpose(%114, axes=[0, 2, 1]) /* ty=Tensor[(12, 64, 512), float32] span=/transformer/h.1/attn/MatMul_1:0:0 */;
  %117 = nn.batch_matmul(%115, %116, out_dtype="float32", transpose_b=True) /* ty=Tensor[(12, 512, 64), float32] span=/transformer/h.1/attn/MatMul_1:0:0 */;
  %118 = reshape(%117, newshape=[1, 12, 512, 64]) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.1/attn/MatMul_1:0:0 */;
  %119 = transpose(%118, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 512, 12, 64), float32] span=/transformer/h.1/attn/Transpose_4:0:0 */;
  %120 = reshape(%119, newshape=[1, 512, 768]) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/attn/Reshape_3:0:0 */;
  %121 = reshape(%120, newshape=[-1, 768]) /* ty=Tensor[(512, 768), float32] span=/transformer/h.1/attn/c_proj/Reshape:0:0 */;
  %122 = transpose(%transformer.h.1.attn.c_proj.weight, axes=[1, 0]) /* ty=Tensor[(768, 768), float32] span=/transformer/h.1/attn/c_proj/Gemm:0:0 */;
  %123 = nn.dense(%121, %122, units=768) /* ty=Tensor[(512, 768), float32] span=/transformer/h.1/attn/c_proj/Gemm:0:0 */;
  %124 = add(%123, %transformer.h.1.attn.c_proj.bias) /* ty=Tensor[(512, 768), float32] span=/transformer/h.1/attn/c_proj/Gemm:0:0 */;
  %125 = reshape(%124, newshape=[1, 512, 768]) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/attn/c_proj/Reshape_1:0:0 */;
  %126 = add(%125, %80) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/Add:0:0 */;
  %127 = mean(%126, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_2/LayerNormalization:0:0 */;
  %128 = variance(%126, %127, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_2/LayerNormalization:0:0 */;
  %129 = add(%128, 1e-05f /* ty=float32 span=/transformer/h.1/ln_2/LayerNormalization:0:0 */) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_2/LayerNormalization:0:0 */;
  %130 = sqrt(%129) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_2/LayerNormalization:0:0 */;
  %131 = subtract(%126, %127) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/ln_2/LayerNormalization:0:0 */;
  %132 = divide(1f /* ty=float32 span=/transformer/h.1/ln_2/LayerNormalization:0:0 */, %130) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.1/ln_2/LayerNormalization:0:0 */;
  %133 = multiply(%131, %132) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/ln_2/LayerNormalization:0:0 */;
  %134 = multiply(%133, %transformer.h.1.ln_2.weight) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/ln_2/LayerNormalization:0:0 */;
  %135 = add(%134, %transformer.h.1.ln_2.bias) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/ln_2/LayerNormalization:0:0 */;
  %136 = reshape(%135, newshape=[-1, 768]) /* ty=Tensor[(512, 768), float32] span=/transformer/h.1/mlp/c_fc/Reshape:0:0 */;
  %137 = transpose(%transformer.h.1.mlp.c_fc.weight, axes=[1, 0]) /* ty=Tensor[(3072, 768), float32] span=/transformer/h.1/mlp/c_fc/Gemm:0:0 */;
  %138 = nn.dense(%136, %137, units=3072) /* ty=Tensor[(512, 3072), float32] span=/transformer/h.1/mlp/c_fc/Gemm:0:0 */;
  %139 = add(%138, %transformer.h.1.mlp.c_fc.bias) /* ty=Tensor[(512, 3072), float32] span=/transformer/h.1/mlp/c_fc/Gemm:0:0 */;
  %140 = reshape(%139, newshape=[1, 512, 3072]) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.1/mlp/c_fc/Reshape_1:0:0 */;
  %141 = power(%140, 3f /* ty=float32 span=/transformer/h.1/mlp/act/Constant_1:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.1/mlp/act/Pow:0:0 */;
  %142 = multiply(%141, 0.044715f /* ty=float32 span=/transformer/h.1/mlp/act/Constant_2:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.1/mlp/act/Mul_1:0:0 */;
  %143 = add(%140, %142) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.1/mlp/act/Add:0:0 */;
  %144 = multiply(%143, 0.797885f /* ty=float32 span=/transformer/h.1/mlp/act/Constant_3:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.1/mlp/act/Mul_2:0:0 */;
  %145 = tanh(%144) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.1/mlp/act/Tanh:0:0 */;
  %146 = multiply(%140, 0.5f /* ty=float32 span=/transformer/h.1/mlp/act/Constant:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.1/mlp/act/Mul:0:0 */;
  %147 = add(%145, 1f /* ty=float32 span=/transformer/h.1/mlp/act/Constant_4:0:0 */) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.1/mlp/act/Add_1:0:0 */;
  %148 = multiply(%146, %147) /* ty=Tensor[(1, 512, 3072), float32] span=/transformer/h.1/mlp/act/Mul_3:0:0 */;
  %149 = reshape(%148, newshape=[-1, 3072]) /* ty=Tensor[(512, 3072), float32] span=/transformer/h.1/mlp/c_proj/Reshape:0:0 */;
  %150 = transpose(%transformer.h.1.mlp.c_proj.weight, axes=[1, 0]) /* ty=Tensor[(768, 3072), float32] span=/transformer/h.1/mlp/c_proj/Gemm:0:0 */;
  %151 = nn.dense(%149, %150, units=768) /* ty=Tensor[(512, 768), float32] span=/transformer/h.1/mlp/c_proj/Gemm:0:0 */;
  %152 = add(%151, %transformer.h.1.mlp.c_proj.bias) /* ty=Tensor[(512, 768), float32] span=/transformer/h.1/mlp/c_proj/Gemm:0:0 */;
  %153 = reshape(%152, newshape=[1, 512, 768]) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/mlp/c_proj/Reshape_1:0:0 */;
  %154 = add(%126, %153) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.1/Add_1:0:0 */;
  %155 = mean(%154, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.2/ln_1/LayerNormalization:0:0 */;
  %156 = variance(%154, %155, axis=[2], keepdims=True) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.2/ln_1/LayerNormalization:0:0 */;
  %157 = add(%156, 1e-05f /* ty=float32 span=/transformer/h.2/ln_1/LayerNormalization:0:0 */) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.2/ln_1/LayerNormalization:0:0 */;
  %158 = sqrt(%157) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.2/ln_1/LayerNormalization:0:0 */;
  %159 = subtract(%154, %155) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.2/ln_1/LayerNormalization:0:0 */;
  %160 = divide(1f /* ty=float32 span=/transformer/h.2/ln_1/LayerNormalization:0:0 */, %158) /* ty=Tensor[(1, 512, 1), float32] span=/transformer/h.2/ln_1/LayerNormalization:0:0 */;
  %161 = multiply(%159, %160) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.2/ln_1/LayerNormalization:0:0 */;
  %162 = multiply(%161, %transformer.h.2.ln_1.weight) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.2/ln_1/LayerNormalization:0:0 */;
  %163 = add(%162, %transformer.h.2.ln_1.bias) /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.2/ln_1/LayerNormalization:0:0 */;
  %164 = reshape(%163, newshape=[-1, 768]) /* ty=Tensor[(512, 768), float32] span=/transformer/h.2/attn/c_attn/Reshape:0:0 */;
  %165 = transpose(%transformer.h.2.attn.c_attn.weight, axes=[1, 0]) /* ty=Tensor[(2304, 768), float32] span=/transformer/h.2/attn/c_attn/Gemm:0:0 */;
  %166 = nn.dense(%164, %165, units=2304) /* ty=Tensor[(512, 2304), float32] span=/transformer/h.2/attn/c_attn/Gemm:0:0 */;
  %167 = add(%166, %transformer.h.2.attn.c_attn.bias) /* ty=Tensor[(512, 2304), float32] span=/transformer/h.2/attn/c_attn/Gemm:0:0 */;
  %168 = reshape(%167, newshape=[1, 512, 2304]) /* ty=Tensor[(1, 512, 2304), float32] span=/transformer/h.2/attn/c_attn/Reshape_1:0:0 */;
  %169 = split(%168, indices_or_sections=[768i64, 1536i64], axis=2) /* ty=(Tensor[(1, 512, 768), float32], Tensor[(1, 512, 768), float32], Tensor[(1, 512, 768), float32]) span=/transformer/h.2/attn/Split:0:0 */;
  %170 = %169.0 /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.2/attn/Split:0:0 */;
  %171 = reshape(%170, newshape=[1, 512, 12, 64]) /* ty=Tensor[(1, 512, 12, 64), float32] span=/transformer/h.2/attn/Reshape:0:0 */;
  %172 = transpose(%171, axes=[0, 2, 1, 3]) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.2/attn/Transpose:0:0 */;
  %173 = multiply(%172, meta[relay.Constant][6] /* ty=Tensor[(1), float32] span=/transformer/h.2/attn/Sqrt_1:0:0 */) /* ty=Tensor[(1, 12, 512, 64), float32] span=/transformer/h.2/attn/Mul:0:0 */;
  %174 = %169.1 /* ty=Tensor[(1, 512, 768), float32] span=/transformer/h.2/attn/Split:0:0 */;
